IDENTIFICATION DIVISION.

PROGRAM-ID. VALIDAR.
AUTHOR. DIEGO BARCENA.
DATE-WRITTEN. MAY-2015.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. ORDENADORZUMA.
OBJECT-COMPUTER. ORDENADORZUMA.


INPUT-OUTPUT SECTION.
FILE-CONTROL.

SELECT CLIENTES ASSIGN TO DISK.


DATA DIVISION.

FILE SECTION.
FD CLIENTES.

01 REG-CLIENTES.
      03 CLI-NUM            PIC 9(12).
      03 CLI-NOM            PIC x(55).
      03 CLI-DOMICILIO.
          05 CLI-CALLE-NUM  PIC x(36).
          05 CLI-COLONIA    PIC x(20).
          05 CLI-POBL       PIC x(15).
          05 CLI-CP         PIC 9(6).
     03 CLI-TELEFONO        PIC 9(10).
     03 CLI-ESTATUS         PIC 9(2).
     03 CLI-FEC-ALTA        PIC 9(8).
     03 CLI-FEC-MOD         PIC 9(8).


WORKING-STORAGE SECTION.

77 WS-MODO PIC x.
77 WS-NUM PIC 9(10) VALUE 0.
77 WS-MAS PIC X(2) VALUE "SI".


PROCEDURE DIVISION.


INICIO-PROGRAMA.
PERFORM INICIA.
PERFORM CAPTURA UNTIL WS-MAS="NO".
PERFORM ACABA.
STOP RUN.

INICIA.

DISPLAY "ABRIR ARCHIVO (E=EXTENDED,0=OUTPUT): ".

ACCEPT WS-MODO.

IF WS-MODO = "E"
         OPEN EXTEND CLIENTES
ELSE
     IF WS-MODO = "O"
         OPEN OUTPUT CLIENTES
               ELSE
                    DISPLAY "RESPUESTA INVALIDA".



CAPTURA.

PERFORM DATO1 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM DATO2.
PERFORM DATO3 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM DATO4 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM DATO5 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM DATO6 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM DATO7 UNTIL WS-NUM=1.
MOVE 0 TO WS-NUM. 
PERFORM PREGUNTA.


		DATO1.
		DISPLAY "INGRESA NUMERO DE CLIENTE".
		ACCEPT CLI-NUM.
		IF CLI-NUM>ZERO
		MOVE 1 TO WS-NUM
		ELSE
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATO".
		
		DATO2.
		DISPLAY "INGRESA NOMBRE DE CLIENTE: ".
		ACCEPT CLI-NOM.
		DISPLAY "INGRESA CALLE Y NUMERO: ".
		ACCEPT CLI-CALLE-NUM.
		DISPLAY "INGRESA COLONIA: ".
		ACCEPT CLI-COLONIA.
		DISPLAY "INGRESA POBLACION: ".
		ACCEPT CLI-POBL.

		DATO3.		
		DISPLAY "INGRESA CODIGO POSTAL: ".
		ACCEPT CLI-CP.
		IF CLI-CP>ZERO
		MOVE 1 TO WS-NUM
		ELSE
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATO".

		DATO4.
		DISPLAY "INGRESA NUMERO TELEFONICO".
		ACCEPT CLI-TELEFONO.
		IF CLI-TELEFONO>ZERO
		MOVE 1 TO WS-NUM
		ELSE
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATO".

		
		DATO5.		
		DISPLAY "INGRESA FECHA DE ALTA: "
		ACCEPT CLI-FEC-ALTA.
		IF CLI-FEC-ALTA>ZERO
		MOVE 1 TO WS-NUM
		ELSE 
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATO". 

		DATO6.		
		DISPLAY "INGRESA FECHA DE MODIFICACION: "
		ACCEPT CLI-FEC-MOD.
		IF CLI-FEC-MOD>ZERO
		MOVE 1 TO WS-NUM
		ELSE
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATO".

		DATO7.		
		DISPLAY "INGRESA EL ESTATUS DEL CLIENTE: ".
		ACCEPT CLI-ESTATUS.
		IF CLI-ESTATUS>ZERO
		MOVE 1 TO WS-NUM
		ELSE
		DISPLAY "NO PUEDES INGRESAR ESE TIPO DE DATOS".

		


PREGUNTA.
    WRITE REG-CLIENTES.
      DISPLAY "QUIERES AGREGAR OTRO CLIENTE (SI/NO): ".
      ACCEPT WS-MAS.
ACABA.


CLOSE CLIENTES.













